# ConnectorReferenceIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConnectorReferenceIndex Property
ParameterTypeId Class See Also
---
"Link Connector Index"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConnectorReferenceIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConnectorReferenceIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConnectorReferenceIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace